# --- Сборка бинарного файла ---
# Используем минимальный образ Alpine для сборки
# Убедитесь, что версия Go (1.25) соответствует вашей локальной версии
FROM golang:1.25-alpine AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем go.mod и go.sum для скачивания зависимостей.
# Это делается до копирования остального кода, чтобы Docker мог кешировать зависимости,
# если они не меняются.
COPY go.mod go.sum ./

# Скачиваем зависимости.
RUN go mod download

# Копируем весь исходный код приложения
COPY . .

# Собираем приложение.
# CGO_ENABLED=0 делает бинарник статическим, что важно для минимальных образов типа Alpine.
# -ldflags="-w -s" убирает отладочную информацию, уменьшая размер бинарника.
# Убедитесь, что путь к main.go верен (./cmd/main/main.go).
RUN CGO_ENABLED=0 GOOS=linux GOARCH=amd64 go build -ldflags="-w -s" -o auth-service ./main.go

# --- Финальный образ ---
# Используем минимальный образ Alpine для финального образа.
FROM alpine:latest

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем собранный бинарный файл из образа сборки (builder)
COPY --from=builder /app/auth-service /app/auth-service

# Открываем порт, который слушает ваше приложение.
# По умолчанию в вашем коде для AuthHandler это 8080.
EXPOSE 8080

# Команда для запуска приложения при старте контейнера.
CMD ["/app/auth-service"]